---
kind: other
id: Properties.T:Autodesk.Revit.DB.DirectContext3D.DirectContext3DHandleSettings
source: html/276778e3-3fcd-6476-54f9-1d58009068b8.htm
---
# DirectContext3DHandleSettings Properties

Specifies whether the .NET object represents a valid Revit entity.